<template>
  <div class="item-list">
    <div v-for="(item,index) in retailList" :key="index" class="item">
      <div class="title">{{item.name}}</div>
      <div class="preview" @click="handleDetail(item)">
        <img :src="getImg(item.file)">
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      retailList: [
        {
          name: 'hey leo',
          desc: 'hey leo是一个中国的高端甜品品牌，创世人为三个狮子座的女生，在甜品品牌众多小清新的格调下，做出了差异化高端的品牌视觉。',
          text: 'hey leo是一个中国的高端甜品品牌，创世人为三个狮子座的女生，在甜品品牌众多小清新的格调下，做出了差异化高端的品牌视觉。',
          file: 'heyleo',
          count: 6
        },
        {
          name: '联达地产',
          desc: '东山联达房地产开发有限公司，品牌全面换新，在更具时代战略化的企业品牌策略下与企业文化融合，更具时代特色。',
          text: '标志设计如同碧海中的扬帆起航的帆船和展翅飞翔的海鸟，表现企业激流勇进追求卓越的企业精神，寓意深刻，符合企业文化与战略发展需求。',
          file: 'lianda',
          count: 5
        },
        {
          name: '楼妈鸭头',
          desc: '衢州鸭头是衢州“三头一掌”中，面市最早的也是名气最大的。 它是上世纪80年代始见于衢州市面上的经济小吃。',
          text: '品牌风格源自衢州鸭战争时期兴起的品牌故事。加以修饰，融入武侠特色元素，符合历史特性，更使品牌具备独树一帜的风格。',
          file: 'louma',
          count: 5
        },
        {
          name: '南湘里美食街',
          desc: '长沙美食名遍中国各地，中山商业街为满足消费者需求，引入各地具备传统文化的美食，老长沙美食街作为其主打文化特色，并在开业吸引大量消费者。',
          text: '南湘里老长沙美食街品牌视觉的开发项目，结合老长沙文化元素，并融入属于80.90.00后等目标消费群体审美的潮流元素，打造具备长沙文化的潮流美食品牌。',
          file: 'nanxiangli',
          count: 5
        },
        {
          name: 'BitBitCare',
          desc: 'bitbitcare数字化健康专家，专注数字化美食消费市场和慢病调养专业市场，通过智能设备建立健康数据系统，并最终形成可定制的健康食品方案应用于使用者。',
          text: '',
          file: 'bitbit',
          count: 6
        },
        {
          name: 'EDEL',
          desc: 'EDEl是由法国著名设计师精心打造的高端设计师品牌，以简约时尚的欧式设计风格和媲美高级手工定制的精细工艺获得了众多消费者的认可和喜爱。品牌传承优雅内涵，展现成熟女性的智慧力量，引导现代都市女性追求值得拥有的穿衣格调与生活方式。',
          text: '',
          file: 'edel',
          count: 3
        },
        {
          name: '华见 Supervalues',
          desc: '打造中国未来的全新主力业态——生鲜食品折扣超市，体现高品质更低价的核心理念，不奢华但有趣而时尚，满足中产家庭生活必需及高频消费诉求。',
          text: '我们秉持现代的设计理念，去繁为简，打造面向大众中产阶层的简洁高效店铺采用独创的华见零售设计思维，从设计、辨识度、告诉反馈、高效投入的角度，思考零售本源，将动线布局、视觉识别、陈列功能作为主要功能体现，将顾客视点从繁复的装饰空间中拉回到商品上，通过视觉传递商品信息，通过陈列凸显商品品质，通过灯光加强空间场域的氛围。空间中的造型设计体现功能与美的结合，有用且美观。商品本身的优质价廉成为卖场核心的吸引力，整体环境舒适、明亮，为上品服务，让顾客内心的愉悦，成为真正的购物体验',
          file: 'huajian',
          count: 11
        },
        {
          name: 'V+城市精品超市',
          desc: '华润万家“V+城市精品超市”重点经营生鲜食品、个人护理用品类，以优选、健康有机的组合，通过欧式的卖场设计，通过情景式的商品展示以及细致、贴心的服务配套，经营两万个丰富的品种，满足消费者对日常生活品质的需求。',
          text: '',
          file: 'v+',
          count: 5
        },
        {
          name: '华润万家品牌升级',
          desc: '',
          text: '',
          file: 'vanguard',
          count: 8
        },
        {
          name: 'W37',
          desc: '家家悦旗下针对年轻人的社区型购物中心，旨在打造时尚生活聚集地的年轻人聚会盒子，购物中心位于威海经区商业核心地段，是威海首家以集装箱、海港码头、室内街区为主导设计元素，集吃、喝、玩、乐、购、文、体、娱为一体的时尚潮流、个性酷炫的购物中心，涵盖百货、超市、餐饮、娱乐等多种业态，汇聚200多家个性潮流品牌，集合50多家主题餐厅美食，主题鲜明的潮趣空间，成为年轻人大爱的潮流集散地。',
          text: '品牌视觉的开发从项目初期的定位开始，深入理解核心客群80、90后年轻人，考虑到年轻潮流与趋势充满着可变性，所以不应在设计中过多使用当下的流行元素，而更应去体会80、90后在孩童时期的幻想与美好记忆，于是我们从80年90年代的游戏机、电影、动画、音乐等多中文化元素提取灵感，并与W37空间中的集装箱元素做结合，形成一套独特的视觉语言。',
          file: 'w37',
          count: 9
        },
        {
          name: '博鳌国际时尚周',
          desc: '海南岛在进行国际化建设的进程中举办大型国际时尚活动势在必行；本次博鳌国际时尚周通过世界级各平台的宣传、国内媒体的持续报道、世界各大平台的参与以及后续活动的持续炒热必将引起国际新的时尚风暴；促进琼海与国际文化的接轨，同时也符合琼海市的国际化大环境发展利益，顺应了地区和全球的合作潮流。',
          text: '时尚周邀请来自国际的时尚团队及来自中国从事时尚艺术音乐行业相关的专业团队，将博鳌国际时尚周从一个简单的作品发布平台逐步链接贯穿至整个时尚、科技生活、商贸交易等产业链，不断打破传统时装周的运行模式，通过时尚、艺术和音乐，使琼海突破海岛旅游等单一产业，创新的格局和时尚设计氛围注入商业活力。主视觉设计“鳌”，源自古典神话南海龙王女儿之子，龙头龟背麒麟尾。而时尚源自西方，博鳌时装周是一次东西方文化的碰撞、交流。通过上部的现代感文字处理结合下部书法体，体现中西文化交流结合出的全新文化符号，凸显博鳌地区的文化特殊性以及此次时装周的时代意义。',
          file: '博鳌',
          count: 5
        },
        {
          name: '乐购 express',
          desc: '2015年华润万家“乐购express”推出，优化便利超市的业务模式，提升便利超市的品牌影响力，向中西部三四线城市下沉，进一步实现与乐购之间的融合。设有生鲜区域提供一站式服务外，还设有专门的休闲餐饮区，而最大的亮点则在于“乐购express”便利超市在卖场后区设置“电商中转站”以及卖场前区预留“电商自提柜，为日后“线上线下”一站式体验。',
          text: 'Life Line经营理念打造简约视觉风格，外观上用“温馨、时尚、精致、简约”来形容，用绿色笼罩的生鲜区域寓意着“每日新鲜，美味安全”，给人一种置身自然之中的健康清新之感，而米黄和深咖的色调，则用干货食品及日用百货区域，让人视觉舒适，情感放松，在愉悦的氛围及感受下享受选购商品的过程。店面环境凸显健康与节能环保在追求简约、精致设计风格的同时，在工程建造及装饰工艺上，此店也比以往更加用心，地面选择“金刚砂”地面工艺，相比普通地面，更加耐磨易维护使卖场看起来干净整洁，坚实明亮。同时，为给顾客留出更宽敞的购物空间，“乐购express”增加了60平米的面积同时减少了20余组货架，这样可使卖场布局更加合理，留给顾客更加宽敞的购物通道，和更加舒适的空间感觉。而灯光照明则全部为LED节能灯，黄白相间的灯光营造出柔和美妙的视感。',
          file: '乐购',
          count: 6
        },
        {
          name: '青橙优选 GreenOrange',
          desc: '青橙优选商贸有限公司，是一家致力于发展“中国城镇社区便利店第一品牌”的零售特许连锁商业管理和信息咨询服务的新秀公司。',
          text: '相较齐全的生活日用百货品类为主体、以简洁舒适的购物体验为依归，通过60-100㎡的资源整合，满足中低线城市家庭群体的绿色健康、实惠便利、高性价比的消费需求；并通过低投资高回报的设计手法，形成标准化快速规模化复制的发展目标。成为二三线城市群知名的以便利店为经营主体的优秀零售商，通过轻资产的方式运作，实现快速规模化的发展目标。品牌核心图形以看清人的对话方式“对话框”为基础，结合橙子造型，绿叶的图形化处理表达年轻人的最佳便利店之选的概念，整体视觉传递亲和的、可爱的、巧妙的方式呈现，整体空间设计以橙色和绿色为主，表达天然、品质、轻松的概念。',
          file: '青橙',
          count: 8
        },
        {
          name: '家家悦生活港',
          desc: '家家悦集团全新打造的零售新业态生活港，从新鲜龙虾到进口佳酿，从脆爽大煎饼到精巧小寿司，从酸甜车厘子到火辣小火锅，家家悦生活港犹如一座通航世界各地的美食码头，时刻都有来自搭载全球各地美食的货轮进港，为消费者带来最新鲜、最地道的世界美食，通过线上与线下全渠道覆盖、到店与到家全方位服务，打造全新生活方案的提供者和解决者。',
          text: '',
          file: '生活港',
          count: 5
        },
        {
          name: '昇菘超市',
          desc: '昇菘集团由林福星和他的兄弟——哥哥林福荣和弟弟林佑龙，在1985年一起创立。如今，昇菘超市的零售店面遍布新加坡全岛37个地点，2016年昇菘超市中国首店落户昆明。',
          text: '以创作能够充分体现新鲜、健康、品质、贴心的店铺设计，并受大众中产阶层喜欢的店铺为目标。这里吃的东西非常丰富，新鲜而有营养， 店面形象具备天然健康、有机的品质。 华见在理解上述经营理念的基础上，提出简单→削除浪费的设计，店铺的定位是大众中产阶层，去掉不要太多的华丽复杂的造型。 另外简单的内装在费用上有很多好处，对于实际中的多店复制也十分有效。',
          file: '昇菘',
          count: 9
        },
        {
          name: 'TUODONG 拓东旗舰店',
          desc: '拓东公司始创于公元1684年永香斋酱园，经过三百多年的传承和发展，现已发展成为中国调味品著名品牌企业50强的中华老字号企业。目前拥有“拓东”、“永香斋”“昆湖”“滇池”“山茶花”等不同类别的八个注册商标，主要有酱油、食醋、酱类、酱咸菜四大类30多个产品，多年来昆明百姓排队购买拓东酱油已成为一道独特的风景线，其产品行销省内外，特别是云南玫瑰大头菜曾远销香港、新加坡、马来西亚等海外市场。',
          text: '对于一个百年老字号品牌来说，不论是生产加工，还是终端营销，都要做变革，要融入现代商业模式之中，不变的是味道。通过品牌升级和店铺设计，让大众重新认识拓东，并对酱油有新的认识引领大众追求“讲究”的品质生活态度。我们分三个维度进行店铺规划：生产line——强调酿造工艺，产品line——强调零售本质酱油主题店，品牌文化line——品牌价值传递、寿司体验中心。选用原生态材质强调品质与经典，体现品牌文化与历史沉淀，围绕酱油主题的生活氛围。',
          file: '拓东',
          count: 8
        },
        {
          name: '未来home',
          desc: '富士康深圳龙华厂区开设的一家智慧零售demo 店，并按照商业计划向厂区 店，并按照商业计 划向厂区 /厂 外进行复制。使之成为日后万马奔腾的经营业务之一',
          text: '结合厂区人员属性和购物习惯 针 对 都 市 新 青 年 、白 领 、蓝 领 及 部 分 家 庭 消 费 的 日 常 性 消 费 同时满足一日三餐的休闲餐饮消费场景 配合智能零售的无人智慧商店，品牌视觉通过创造一个符号 划分过去与未来 为前行提供动力从数学符号“不等于”中提取元素 形成未来home',
          file: '未来home',
          count: 8
        }
      ]
    }
  },
  methods: {
    handleDetail(item) {
      this.$router.push({
        path: '/brand-detail',
        query: {
          name: item.name,
          desc: item.desc,
          text: item.text,
          file: item.file,
          count: item.count
        }
      })
    },
    getImg(file) {
      return require('@/assets/imgs/brand/'+file+'/preview.jpg')
    }
  }
};
</script>

<style lang="less" scoped>
.item-list {
  display: flex;
  justify-content: space-between;
  flex-wrap: wrap;
  &::after {
    content: '';
    width: 31%;
    border:1px solid transparent;
  }
  @media screen and (max-width: 500px){
        display: block;
      }
  .item {
    width: 31%;
    margin-bottom: 20px;
    @media screen and (max-width: 500px){
        width: 100%;
        .title {
          text-indent: 10px;
        }
      }
    .title {
      font-size: 16px;
      line-height: 60px;
      font-weight: 600;
    }
    .preview {
      background-color: rgb(228, 228, 228);
      cursor: pointer;
      overflow: hidden;
      img {
        width: 100%;
        height: 100%;
        transition: all .5s;
        -moz-transition: all .5s;
        -webkit-transition: all .5s;
        -o-transition: all .5s;
      }
      &:hover {
        img {
          transform: scale(1.2);
          -moz-transform: scale(1.2);
          -webkit-transform: scale(1.2);
          -o-transform: scale(1.2);
        }
      }
    }
  }
}
</style>