<template>
  <div class="item-list">
    <div v-for="(item,index) in retailList" :key="index" class="item">
      <div class="title">{{item.name}}</div>
      <div class="preview" @click="handleDetail(item)">
        <img :src="getImg(item.file)">
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      retailList: [
        {
          name: '华见 Supervalues',
          desc: '打造中国未来的全新主力业态——生鲜食品折扣超市，体现高品质更低价的核心理念，不奢华但有趣而时尚，满足中产家庭生活必需及高频消费诉求。',
          text: '我们秉持现代的设计理念，去繁为简，打造面向大众中产阶层的简洁高效店铺采用独创的华见零售设计思维，从设计、辨识度、告诉反馈、高效投入的角度，思考零售本源，将动线布局、视觉识别、陈列功能作为主要功能体现，将顾客视点从繁复的装饰空间中拉回到商品上，通过视觉传递商品信息，通过陈列凸显商品品质，通过灯光加强空间场域的氛围。空间中的造型设计体现功能与美的结合，有用且美观。商品本身的优质价廉成为卖场核心的吸引力，整体环境舒适、明亮，为上品服务，让顾客内心的愉悦，成为真正的购物体验',
          file: 'huajian',
          count: 11
        },
        {
          name: '贵阳星力集团 Lavant生活馆',
          desc: '贵阳星力集团旗下精品超市品牌“Lavant生活馆”',
          text: '',
          file: 'lavant',
          count: 6
        },
        {
          name: '乐购 express',
          desc: '2015年华润万家“乐购express”推出，优化便利超市的业务模式，提升便利超市的品牌影响力，向中西部三四线城市下沉，进一步实现与乐购之间的融合。设有生鲜区域提供一站式服务外，还设有专门的休闲餐饮区，而最大的亮点则在于“乐购express”便利超市在卖场后区设置“电商中转站”以及卖场前区预留“电商自提柜，为日后“线上线下”一站式体验。',
          text: 'Life Line经营理念打造简约视觉风格，外观上用“温馨、时尚、精致、简约”来形容，用绿色笼罩的生鲜区域寓意着“每日新鲜，美味安全”，给人一种置身自然之中的健康清新之感，而米黄和深咖的色调，则用干货食品及日用百货区域，让人视觉舒适，情感放松，在愉悦的氛围及感受下享受选购商品的过程。店面环境凸显健康与节能环保在追求简约、精致设计风格的同时，在工程建造及装饰工艺上，此店也比以往更加用心，地面选择“金刚砂”地面工艺，相比普通地面，更加耐磨易维护使卖场看起来干净整洁，坚实明亮。同时，为给顾客留出更宽敞的购物空间，“乐购express”增加了60平米的面积同时减少了20余组货架，这样可使卖场布局更加合理，留给顾客更加宽敞的购物通道，和更加舒适的空间感觉。而灯光照明则全部为LED节能灯，黄白相间的灯光营造出柔和美妙的视感。',
          file: '乐购',
          count: 6
        },
        {
          name: '了凡农创',
          desc: '以原味食材为根本、以极致体验为准则，打造中国“奢吃品”品牌，了凡农创网络科技有限公司是一家集社交新零售、订单农业、软件服务、供应链管理、线下体验店为一体的产销融合服务平台，始终秉承着“助农增收、助民创业、助企升级、为国效力”的企业使命。',
          text: '结合客群特点，满足家庭厨房生活基本需求，精选重点品类，结合24节气主推原味食材。体现品质生活与养生的基本诉求，线下引流至线上平台。空间设计采用泥土、农田的自然元素加入现代的空间设计结构凸显天然、健康的核心品质。',
          file: '了凡网站',
          count: 11
        },
        {
          name: '青橙优选 GreenOrange',
          desc: '青橙优选商贸有限公司，是一家致力于发展“中国城镇社区便利店第一品牌”的零售特许连锁商业管理和信息咨询服务的新秀公司。',
          text: '相较齐全的生活日用百货品类为主体、以简洁舒适的购物体验为依归，通过60-100㎡的资源整合，满足中低线城市家庭群体的绿色健康、实惠便利、高性价比的消费需求；并通过低投资高回报的设计手法，形成标准化快速规模化复制的发展目标。成为二三线城市群知名的以便利店为经营主体的优秀零售商，通过轻资产的方式运作，实现快速规模化的发展目标。品牌核心图形以看清人的对话方式“对话框”为基础，结合橙子造型，绿叶的图形化处理表达年轻人的最佳便利店之选的概念，整体视觉传递亲和的、可爱的、巧妙的方式呈现，整体空间设计以橙色和绿色为主，表达天然、品质、轻松的概念。',
          file: '青橙',
          count: 8
        },
        {
          name: '昇菘超市',
          desc: '昇菘集团由林福星和他的兄弟——哥哥林福荣和弟弟林佑龙，在1985年一起创立。如今，昇菘超市的零售店面遍布新加坡全岛37个地点，2016年昇菘超市中国首店落户昆明。',
          text: '以创作能够充分体现新鲜、健康、品质、贴心的店铺设计，并受大众中产阶层喜欢的店铺为目标。这里吃的东西非常丰富，新鲜而有营养， 店面形象具备天然健康、有机的品质。 华见在理解上述经营理念的基础上，提出简单→削除浪费的设计，店铺的定位是大众中产阶层，去掉不要太多的华丽复杂的造型。 另外简单的内装在费用上有很多好处，对于实际中的多店复制也十分有效。',
          file: '昇菘',
          count: 9
        },
        {
          name: 'TUODONG 拓东旗舰店',
          desc: '拓东公司始创于公元1684年永香斋酱园，经过三百多年的传承和发展，现已发展成为中国调味品著名品牌企业50强的中华老字号企业。目前拥有“拓东”、“永香斋”“昆湖”“滇池”“山茶花”等不同类别的八个注册商标，主要有酱油、食醋、酱类、酱咸菜四大类30多个产品，多年来昆明百姓排队购买拓东酱油已成为一道独特的风景线，其产品行销省内外，特别是云南玫瑰大头菜曾远销香港、新加坡、马来西亚等海外市场。',
          text: '对于一个百年老字号品牌来说，不论是生产加工，还是终端营销，都要做变革，要融入现代商业模式之中，不变的是味道。通过品牌升级和店铺设计，让大众重新认识拓东，并对酱油有新的认识引领大众追求“讲究”的品质生活态度。我们分三个维度进行店铺规划：生产line——强调酿造工艺，产品line——强调零售本质酱油主题店，品牌文化line——品牌价值传递、寿司体验中心。选用原生态材质强调品质与经典，体现品牌文化与历史沉淀，围绕酱油主题的生活氛围。',
          file: '拓东',
          count: 8
        },
        {
          name: '未来home',
          desc: '富士康深圳龙华厂区开设的一家智慧零售demo 店，并按照商业计划向厂区 店，并按照商业计 划向厂区 /厂 外进行复制。使之成为日后万马奔腾的经营业务之一',
          text: '结合厂区人员属性和购物习惯 针 对 都 市 新 青 年 、白 领 、蓝 领 及 部 分 家 庭 消 费 的 日 常 性 消 费 同时满足一日三餐的休闲餐饮消费场景 配合智能零售的无人智慧商店，品牌视觉通过创造一个符号 划分过去与未来 为前行提供动力从数学符号“不等于”中提取元素 形成未来home',
          file: '未来home',
          count: 8
        }
      ]
    }
  },
  methods: {
    handleDetail(item) {
      this.$router.push({
        path: '/retail-detail',
        query: {
          name: item.name,
          desc: item.desc,
          text: item.text,
          file: item.file,
          count: item.count
        }
      })
    },
    getImg(file) {
      return require('@/assets/imgs/retail/'+file+'/preview.jpg')
    }
  }
};
</script>

<style lang="less" scoped>
.item-list {
  display: flex;
  justify-content: space-between;
  flex-wrap: wrap;
  &::after {
    content: '';
    width: 31%;
    border:1px solid transparent;
  }
  @media screen and (max-width: 500px){
        display: block;
      }
  .item {
    width: 31%;
    @media screen and (max-width: 500px){
        width: 100%;
        .title {
          text-indent: 10px;
        }
      }
    .title {
      font-size: 24px;
      line-height: 60px;
      font-weight: 700;
    }
    .preview {
      background-color: rgb(228, 228, 228);
      height: 260px;
      cursor: pointer;
      overflow: hidden;
      img {
        width: 100%;
        height: 100%;
        transition: all .5s;
        -moz-transition: all .5s;
        -webkit-transition: all .5s;
        -o-transition: all .5s;
      }
      &:hover {
        img {
          transform: scale(1.2);
          -moz-transform: scale(1.2);
          -webkit-transform: scale(1.2);
          -o-transform: scale(1.2);
        }
      }
    }
  }
}
</style>